---
kind: other
id: Methods.T:Autodesk.Revit.DB.RoutingPreferenceManager
source: html/d1058590-20f2-4bb7-ad0c-22f8f13f6234.htm
---
# RoutingPreferenceManager Methods

Adds a new routing preference rule to the rule group.